Repository: Kollocol-Inc/iOS
Catalog: Kollocol/localization.xcstrings
Source language: en
Languages: ru

source: Add question
ru: Добавить вопрос

source: AI
ru: ИИ

# aiCompletionValidationDescription
source: To supplement with AI, specify quiz title or add at least one question
ru: Для дополнения с ИИ необходимо указать название квиза или добавить хотя бы один вопрос

# aiRecommendedScoreFormat
source: Recommended score — %d
ru: Рекомендуемый балл — %d

# aiThinking
source: Thinking...
ru: Думаю...

# allQuestionsReviewed
source: All questions are reviewed
ru: Все вопросы оценены

source: Answer
ru: Ответить

source: Answer (optional)
ru: Ответ (опционально)

source: Answers
ru: Ответы

# attentionTitle
source: Attention
ru: Внимание

# avatarDeleteConfirmationMessage
source: Are you sure you want to delete the photo? This action cannot be undone
ru: Вы уверены, что хотите удалить фото? Отменить это действие невозможно

# avatarTooLargeError
source: The selected photo is too large, choose another one
ru: Выбранная фотография слишком большая, выберите другую

# avatarUploadFailedError
source: An error occurred while uploading avatar, choose another one or try later
ru: Произошла ошибка при загрузке аватара, выберите другую или попробуйте позже

# avatarUploadGenericError
source: An error occurred while uploading the avatar. Choose another one or try again later
ru: Произошла ошибка при загрузке аватара, выберите другую или попробуйте позже

# avatarUploadTooLargeError
source: The selected photo is too large. Please choose another one
ru: Выбранная фотография слишком большая, выберите другую

source: Back
ru: Назад

# cameraAccessDeniedDescription
source: The app has no access to camera. Open Settings, grant permissions, return and try again
ru: У приложения нет доступа к камере. Перейдите в настройки и выдайте соответствующие разрешения, после чего вернитесь обратно и попробуйте снова

source: Cancel
ru: Отмена

# cancelAction
source: Cancel
ru: Отменить

source: Cancel quiz
ru: Отменить квиз

source: Cancel registration
ru: Отменить регистрацию

# cancelRegistrationDescription
source: If registration is canceled, you will be redirected to start screen
ru: При отмене регистрации вы будете направлены на начальный экран

source: Close
ru: Закрыть

source: Confirm
ru: Подтвердить

# confirmAppendGeneratedQuestions
source: Are you sure you want to supplement template with generated questions?
ru: Вы уверены, что хотите дополнить шаблон сгенерированными вопросами?

# confirmAsyncQuizStartByTitleFormat
source: Are you sure you want to start solving quiz %@?
ru: Вы уверены, что хотите приступить к выполнению квиза %@?

# confirmAsyncQuizStartGeneric
source: Are you sure you want to start solving this quiz?
ru: Вы уверены, что хотите приступить к выполнению этого квиза?

# confirmationTitle
source: Confirmation
ru: Подтверждение

# confirmBackUnsavedChanges
source: Are you sure you want to go back? All changes will be permanently lost
ru: Вы уверены, что хотите вернуться назад? Все изменения будут утеряны безвозвратно

# confirmCancelQuizFormat
source: Are you sure you want to cancel quiz %@? This action cannot be undone
ru: Вы уверены, что хотите отменить квиз %@? Это действие необратимо

# confirmDeleteQuestion
source: Are you sure you want to delete the question?
ru: Вы уверены, что хотите удалить вопрос?

# confirmDeleteTemplateFormat
source: Are you sure you want to delete template %@? This action cannot be undone
ru: Вы уверены, что хотите удалить шаблон %@? Это действие необратимо

# confirmExitQuestionsGenerationInProgress
source: Are you sure you want to exit? Question generation is in progress
ru: Вы уверены, что хотите выйти? Генерация вопросов в процессе

# confirmExitQuestionTextGenerationInProgress
source: Are you sure you want to exit? Question text generation is in progress
ru: Вы уверены, что хотите выйти? Генерация текста вопроса в процессе

# confirmExitUnsavedChanges
source: Are you sure you want to exit? All changes will be permanently lost
ru: Вы уверены, что хотите выйти? Все изменения будут утеряны безвозвратно

# confirmGetAiRecommendation
source: Are you sure you want to get AI recommendation?
ru: Вы уверены, что хотите получить рекомендацию от ИИ?

# confirmParaphraseQuestionText
source: Are you sure you want to paraphrase the question text?
ru: Вы уверены, что хотите перефразировать текст вопроса?

# confirmPublishResults
source: Are you sure you want to publish results? All participants will receive a notification. This action cannot be undone
ru: Вы уверены, что хотите опубликовать результаты? Все участники получат уведомление. Это действие необратимо

source: Correct answer
ru: Верный ответ

source: Create
ru: Создать

# darkTheme
source: Dark
ru: Темная

source: Deadline
ru: Дедлайн

source: Delete
ru: Удалить

source: Delete group
ru: Удалить группу

source: Delete Photo
ru: Удалить фото

# deleteQuestionTitle
source: Question deletion
ru: Удаление вопроса

# deleteTemplateTitle
source: Template deletion
ru: Удаление шаблона

source: Description
ru: Описание

source: Edit
ru: Изменить

# editNameOrSurname
source: Edit first or last name
ru: Изменить имя или фамилию

# englishLanguage
source: English
ru: Английский

# enterAnswerPlaceholder
source: Enter answer
ru: Введите ответ

# enterDescriptionPlaceholder
source: Enter description
ru: Введите описание

# enterQuestionPlaceholder
source: Enter question
ru: Введите вопрос

# enterTitlePlaceholder
source: Enter title
ru: Введите название

# errorTitle
source: Error
ru: Ошибка

source: Exit
ru: Выйти

# failedCancelQuiz
source: Failed to cancel quiz
ru: Не удалось отменить квиз

# failedKickParticipant
source: Failed to kick participant
ru: Не удалось выгнать участника

# failedResolveTemplateForUpdate
source: Failed to resolve template for update
ru: Не удалось определить шаблон для обновления

# feedbackMissing
source: No feedback provided
ru: Комментарий отсутствует

# fillAllAnswerOptions
source: Fill all added answer options
ru: Заполните все добавленные варианты ответа

# firstNamePlaceholder
source: First name
ru: Имя

source: Forward
ru: Вперед

source: Gallery
ru: Галерея

source: Grade
ru: Оценить

source: Group
ru: Группа

source: Group invitation
ru: Приглашение в группу

# groupKickParticipantConfirmationFormat
source: Are you sure you want to kick %@?
ru: Вы уверены, что хотите выгнать %@?

# groupDeleteConfirmationFormat
source: Are you sure you want to delete group %@? This action cannot be undone
ru: Вы уверены, что хотите удалить группу %@? Это действие необратимо

# groupLeaveConfirmationFormat
source: Are you sure you want to leave group %@?
ru: Вы уверены, что хотите покинуть группу %@?

# groupServiceErrorBadRequest
source: Client request error
ru: Ошибка на стороне клиента

# groupServiceErrorForbidden
source: You don't have permission to perform this action
ru: Недостаточно прав для выполнения действия

# groupServiceErrorNotFound
source: Group not found
ru: Группа не найдена

# groupServiceErrorOffline
source: No internet connection
ru: Нет интернета

# groupServiceErrorServer
source: Server error. We are waking up devops...
ru: Ошибка на стороне сервера. Идем будить девопса...

# groupServiceErrorUnauthorized
source: Authorization error. Please sign in again
ru: Ошибка авторизации. Выполните вход снова

# groupsNoGroupsWithSuchName
source: There are no groups with this name
ru: Нет групп с таким названием

# groupsNoInvitedParticipants
source: No invited participants
ru: Нет приглашенных участников

# groupsNoMemberGroups
source: You are not a member of any groups
ru: Вы не состоите ни в одной группе

# groupsNoOwnerGroups
source: You don't manage any groups
ru: Вы не управляете ни одной группой

# groupsCreationTitle
source: Group creation
ru: Создание группы

# groupsInvited
source: Invited
ru: Приглашены

# groupsEditingTitle
source: Group editing
ru: Редактирование группы

# groupsParticipantsInfoDescription
source: You can also add new participants after creating the group
ru: Вы также сможете добавить новых участников после создания группы

# groupsEnterEmailPlaceholder
source: Enter email
ru: Введите почту

# groupsSearchPlaceholder
source: Search groups
ru: Поиск групп

# groupsSegmentMember
source: Member
ru: Состою

# groupsSegmentOwner
source: Manage
ru: Управляю

# groupsTitle
source: Groups
ru: Группы

source: Invite
ru: Пригласить

source: Invite participants
ru: Пригласить участников

# inviteParticipantsTitle
source: Invite participants
ru: Пригласить участников

source: Kick
ru: Выгнать

# inputBottomSheetExitWhileGeneratingMessage
source: Template generation is in progress. Are you sure you want to exit?
ru: Генерация шаблона в процессе. Вы уверены, что хотите выйти?

# inputBottomSheetExitWithUnsavedChangesMessage
source: Are you sure you want to exit? All changes will be permanently lost
ru: Вы уверены, что хотите выйти? Все изменения будут утеряны безвозвратно

# insufficientAnswerOptions
source: Not enough answer options
ru: Недостаточно вариантов ответа

# insufficientParticipants
source: Not enough participants
ru: Недостаточно участников

# insufficientQuestions
source: Not enough questions
ru: Недостаточно вопросов

# invalidCodeTitle
source: Invalid code
ru: Неверный код

source: Invalid email format
ru: Неверный формат почты

# invalidQuizCodeError
source: This code does not exist or was entered incorrectly. Please try again
ru: Такой код не существует или Вы ввели код неверно. Попробуйте еще раз

source: Language
ru: Язык

# lastNamePlaceholder
source: Last name
ru: Фамилия

source: Leave
ru: Покинуть

source: Leave group
ru: Покинуть группу

source: Leaderboard
ru: Таблица лидеров

# lightTheme
source: Light
ru: Светлая

source: Loading...
ru: Загрузка...

# mainHostingHeader
source: Hosting
ru: Провожу

# mainJoinButton
source: Let's go!
ru: Погнали!

# mainNoHostingQuizzes
source: There are no quizzes you host
ru: Нет квизов, которые вы проводите

# mainNoParticipatingQuizzes
source: There are no quizzes you participate in
ru: Нет квизов, в которых вы участвуете

# mainParticipatingHeader
source: Participating
ru: Участвую

# minuteShortSingle
source: m
ru: м

# myQuizzesCreateFromScratch
source: From scratch
ru: С нуля

# myQuizzesCreateWithAi
source: With AI
ru: При помощи ИИ

# myQuizzesDeleteTemplateMessage
source: Are you sure you want to delete template %@? This action cannot be undone
ru: Вы уверены, что хотите удалить шаблон %@? Это действие необратимо

# myQuizzesDeleteTemplateTitle
source: Template deletion
ru: Удаление шаблона

# myQuizzesGenerateButton
source: Generate
ru: Сгенерировать

# myQuizzesHostingHeader
source: Hosting
ru: Провожу

# myQuizzesNoCreatedTemplates
source: There are no templates you created
ru: Нет шаблонов, которые вы создали

# myQuizzesNoHostingQuizzes
source: There are no quizzes you host
ru: Нет квизов, которые вы проводите

# myQuizzesNoPendingReviewQuizzes
source: There are no quizzes pending review
ru: Нет квизов, ожидающих оценки

# myQuizzesNoReviewedQuizzes
source: There are no quizzes you reviewed
ru: Нет квизов, которые вы оценили

# myQuizzesNoTemplatesWithSuchName
source: There are no templates with this name
ru: Нет шаблонов с таким названием

# myQuizzesPendingReviewHeader
source: Pending review
ru: Ожидают оценивания

# myQuizzesReviewedHeader
source: Reviewed
ru: Оценены

# myQuizzesSegmentMyQuizzes
source: My Quizzes
ru: Мои квизы

# myQuizzesSegmentTemplates
source: Templates
ru: Шаблоны

# myQuizzesTemplateGenerationPlaceholder
source: Describe the template you want to create
ru: Опишите, какой шаблон вы хотите создать

# myQuizzesTemplateGenerationTitle
source: Template creation
ru: Создание шаблона

# myQuizzesUntitledTemplate
source: untitled
ru: без названия

source: Never
ru: Никогда

source: New quiz
ru: Новый квиз

source: Next question
ru: Следующий вопрос

# noAnswersData
source: No answer data
ru: Нет данных по ответам

# noFinishedParticipants
source: No participants who completed quiz
ru: Нет участников, прошедших квиз

# noNotStartedParticipants
source: No participants who have not started
ru: Нет участников, которые не приступили к прохождению

source: No participants
ru: Нет участников

source: No questions
ru: Нет вопросов

# noQuestionsContainingText
source: No questions containing this text
ru: Нет вопросов, содержащих такой текст

# notificationsHeader
source: Notifications
ru: Уведомления

# notificationsAcceptButton
source: Accept
ru: Принять

# notificationsIgnoreButton
source: Ignore
ru: Игнорировать

# notificationsGoButton
source: Go to
ru: Перейти

# notificationsNoNotifications
source: No notifications
ru: Нет уведомлений

source: Not started
ru: Не приступили

source: OK
ru: ОК

# oneDayBefore
source: 1 day before
ru: За сутки

# oneHourBefore
source: 1 hour before
ru: За час

source: Other participants
ru: Остальные участники

source: Parameters
ru: Параметры

source: Paraphrase
ru: Перефразировать

source: Participant
ru: Участник

# participantGenitive
source: participant
ru: участника

source: Participants
ru: Участники

source: Passed
ru: Прошли

source: Profile photo
ru: Фото профиля

# profileTitle
source: Profile
ru: Профиль

# profileDangerZoneTitle
source: Danger zone
ru: Опасная зона

# profileDeleteAccountButtonTitle
source: Delete account
ru: Удалить аккаунт

# profileDeleteAccountConfirmationDescription
source: Are you sure you want to delete your account? All information associated with your account will be deleted. This action cannot be undone
ru: Вы уверены, что хотите удалить аккаунт? Вся связанная информация с вашим аккаунтом будет удалена. Это действие необратимо

# profileLogoutConfirmationButtonTitle
source: Sign out
ru: Выход

# profileLogoutConfirmationDescription
source: Are you sure you want to sign out of your account?
ru: Вы уверены, что хотите выйти из аккаунта?

# profileLogoutConfirmationTitle
source: Sign out of account
ru: Выход из аккаунта

source: Publish
ru: Опубликовать

# publishUnavailableAsyncDescription
source: Results can be published after deadline ends
ru: Опубликовать результаты можно после конца дедлайна

# publishUnavailableReviewDescription
source: To publish results, all participants must be reviewed
ru: Для публикации результатов необходимо оценить всех участников

source: Question
ru: Вопрос

# questionScoreShortFormat
source: %d pts.
ru: %d б.

# questionsRemainingForReviewFormat
source: Questions remaining for review: %@
ru: Осталось вопросов, ожидающих оценки: %@

source: Question without text
ru: Вопрос без текста

# quizCompletedAwaitReview
source: Quiz completed successfully\nWait for review result
ru: Квиз успешно пройден\nОжидайте получения оценки

# quizConnectionUnavailableFinished
source: The quiz has already finished, unable to join
ru: Квиз уже завершен, подключение невозможно

# quizConnectionUnavailableStarted
source: The quiz has already started, unable to join
ru: Квиз уже начался, подключение невозможно

# quizDefaultTitle
source: Quiz
ru: Квиз

# quizFullyReviewedTitle
source: Quiz is fully reviewed
ru: Квиз полностью проверен

source: Quiz results
ru: Результаты квиза

# quizStartTitle
source: Quiz launch
ru: Запуск квиза

source: Quiz type
ru: Тип квиза

# quizTypeAsync
source: Asynchronous
ru: Асинхронный

# quizTypeAsyncInfo
source: Participants can take the quiz anytime before the deadline
ru: Участники могут проходить квиз в любое время до дедлайна

# quizTypeAsyncShort
source: Async
ru: Асинх.

# quizTypeSync
source: Synchronous
ru: Синхронный

# quizTypeSyncInfo
source: All participants take the quiz simultaneously under the host's control
ru: Все участники проходят квиз одновременно под контролем создателя

# quizTypeSyncShort
source: Sync
ru: Синх.

source: Random order
ru: Случайный порядок

source: Register
ru: Зарегистрироваться

# registrationFailedError
source: Registration failed. Try again or come back later
ru: Ошибка при регистрации. Попробуйте еще раз или вернитесь позже

# registrationTitle
source: Registration
ru: Регистрация

# russianLanguage
source: Russian
ru: Русский

source: Save
ru: Сохранить

source: Score
ru: Балл

source: Search
ru: Поиск

source: Select
ru: Выбрать

source: Search participants
ru: Поиск участников

source: Search questions
ru: Поиск вопросов

# searchSuffixQuizzes
source: quizzes
ru: квизов

# searchSuffixTemplates
source: templates
ru: шаблонов

# secondShortSingle
source: s
ru: с

source: Send again
ru: Отправить снова

source: Send code
ru: Отправить код

# settingsHeader
source: Settings
ru: Настройки

# sixHoursBefore
source: 6 hours before
ru: За 6 часов

source: Something went wrong
ru: Что-то пошло не так

source: Specify at least one correct answer
ru: Укажите хотя бы один верный ответ

source: Specify correct answer option
ru: Укажите верный вариант ответа

# specifyNameAndSurname
source: Specify first and last name
ru: Укажите имя и фамилию

source: Specify question text
ru: Укажите текст вопроса

source: Specify template title
ru: Укажите название шаблона

source: Specify title
ru: Укажите название

source: Specify valid deadline
ru: Укажите корректный дедлайн

source: Start
ru: Запустить

# startAsyncQuizTitle
source: Start solving
ru: Приступить к выполнению

# startEnterEmailTitle
source: Enter your email
ru: Введите вашу почту

source: Start quiz
ru: Запустить квиз

# startQuizGroupInfoDescription
source: The quiz will be assigned to all members of the selected group
ru: Квиз будет назначен всем участникам выбранной группы

source: Stay
ru: Остаться

source: Supplement with AI
ru: Дополнить с ИИ

# systemLanguage
source: System
ru: Системный

# systemTheme
source: System
ru: Системная

source: Take photo
ru: Сделать фото

# templateCreationTitle
source: Template creation
ru: Создание шаблона

# templateEditingTitle
source: Template editing
ru: Изменение шаблона

# templateQuestionsSummaryScoreTimeFormat
source: %d pts. • %@
ru: %d б. • %@

source: Theme
ru: Тема

# threeHoursBefore
source: 3 hours before
ru: За 3 часа

source: Time
ru: Время

# timeHourShort
source: h.
ru: ч.

# timeMinuteShort
source: m.
ru: м.

# timeMinutesSecondsFormat
source: %02d m. %02d s.
ru: %02d м. %02d с.

# timeSecondShort
source: s.
ru: с.

# timeZeroSeconds
source: 0 s.
ru: 0 с.

source: Title
ru: Название

# twelveHoursBefore
source: 12 hours before
ru: За 12 часов

source: untitled
ru: без названия

source: Update
ru: Обновить

# verifyCodeEnterTitle
source: Enter code
ru: Введите код

# verifyCodeResendCountdownFormat
source: Send again in %@ s
ru: Отправить снова %@ с

# verifyCodeResendTooSoonError
source: Code was already sent recently. Try requesting it again a little later
ru: Код уже отправлялся недавно. Попробуйте запросить его повторно чуть позже

# verifyCodeSentToPrefix
source: Your code was sent to\n
ru: Ваш код был отправлен на\n

# verifyCodeTooManyAttemptsError
source: Too many code entry attempts. Try again in a few minutes
ru: Слишком много попыток ввода кода. Попробуйте еще раз через несколько минут

# tooManyRequestsError
source: Too many requests. Try again in a few minutes
ru: Слишком много попыток. Попробуйте еще раз через пару минут

# waitingAllParticipantsAnswers
source: Waiting for answers from all participants
ru: Ожидаем ответа всех участников

# waitingNextQuestion
source: Waiting for next question
ru: Ожидаем следующего вопроса

# waitingOthersAnswering
source: Waiting while\nothers answer...
ru: Ждем пока\nостальные ответят...

# waitingStart
source: Waiting for start...
ru: Ожидаем начала...

source: Without group
ru: Без группы

# withRegretTitle
source: We regret to inform you...
ru: С прискорбием сообщаем...

source: You
ru: Вы

# yourPlacePrefix
source: Your place:
ru: Ваше место:
